[shoppingCart.html](https://github.com/user-attachments/files/22041440/shoppingCart.html)
<!DOCTYPE html>
<html lang="en">
  <head>
    <meta charset="UTF-8" />
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <title>장바구니</title>
  </head>
  <body>
    <header>
      <!-- 헤더 영역에 표시될 홈페이지 이름추후 팀원양식으로 변경 -->
      <div>홈페이지이름</div>
      <!-- 헤더 영역에 표시할 내비게이션 영역,메뉴,상품카테고리 선택,추후 팀원양식으로 만춤필요 -->
      <nav>
        <ul>
          <li><a href="#">메뉴</a></li>
          <li><a href="#">상의</a></li>
          <li><a href="#">하의</a></li>
          <li><a href="#">치마</a></li>
          <li><a href="#">아우터</a></li>
          <li><a href="#">악세사리</a></li>
          <li><a href="#">마이페이지</a></li>
          <li><a href="#">고객센터</a></li>
          <li><a href="#">장바구니</a></li>
        </ul>
      </nav>
    </header>
    <!-- 바디에 띄울 장바구니 제목,가운데로 정렬필요 -->
    <!-- 상단 헤더영역에 쇼핑몰이름이 크게 뜰걸 고려해 h1태그가 아닌 h2태그로 현재 페이지인 장바구니부졔(?)작성 -->
    <h2>장바구니</h2>
    <!-- 장바구니에서 핵심이 되는 내용 -->
    <!-- 장바구니만의 고유 내용으로 구성위해 메인태그 사용,메인은 한번만 사용가능 -->
    <main>
      <!-- 콘텐츠 영역을 나타내기 위해 section사용 -->
      <!-- 장바구니 상품이 추가될 영역을 표시하고 싶어사용  -->
      <!-- hr태그를 사용해 '장바구니'라는 부제와 구분선 사용 -->
      <hr />
      <section>
        <!-- 상품이 추가될 카테고리에 공통적인 목록을 표시하고 싶어서 table사용 -->
        <!-- 목록을 일렬로 표시하고 각 구간을 나누기 위해 표만드는 table태그 사용후 목록을 1행으로 1열로 표시 -->
        <!-- th태그를 사용하여 표의 제목행에 셀을 만드는 방식을 사용하고 이를 목록을 셀로 나누는데 적용 -->
        <!-- 여러 상품이 추가될걸 고려하여 나중에 세부적인 article태그 사용고려중 -->
        <table>
          <tr>
            <th>이미지</th>
            <th>상품정보</th>
            <th>수량</th>
            <th>구매금액</th>
            <th>배송구분</th>
            <th>배송비</th>
            <th>선택</th>
          </tr>
        </table>
      </section>
      <!-- 장바구니에 넣어놓은 상품 중 구매를 원하는 최종구매목록과 전체 금액 배송비등을 보여주기위해 section별도구성 -->
      <!-- 테이블 사용해 목록 1행 1열로 표시 -->
      <!-- 장바구니로 가져온 목록과  결제할 목록을 구분하기 위해 hr로 구분선표시 -->
      <hr />
      <section>
        <table>
          <!-- 상품금액 ,총 배송비, 결제예정금액을 1행에 두고 상품금액의 합계,총배송비,결제예정금액의 실제 금액 표시를 2행에 배치 -->
          <!-- thead태그와 tfoot태그를 사용하여 각각 표의 제목과 표의 요약으로 나누려 시도했으나 실패,,,,추후 방법고려 -->
          <tr>
            <td>상품금액</td>
            <td>총 배송비</td>
            <td>결제예정금액</td>
          </tr>
          <tr>
            <!-- 상품금액합계,총배송비,결제예정금액(상품금액합계+총배송비)자동 연산되게 필요 -->
            <td>0000원</td>
            <td>0000원</td>
            <td>0000원</td>
          </tr>
        </table>
        <!-- 구매결정 내린 상품에 대한 왼쪽 체크박스 필요 -->
        <!-- 전체 상품주문,선택상품주문 버튼 필요 -->
      </section>
      <footer>
        <!-- 하단에 회사 정보등 표기,팀원들과 이야기후 수정필요 -->
        <!-- footer오른쪽 -->
        <p>
          재단법인 그린쇼핑 대표 :name 경기 성남시 분당구 돌마로46
          5층(그린쇼핑몰)
        </p>
        <p>사업자등록번호 : 113-46-92929</p>
        <p>통신판매업신고번호 : 제2025-경기성남-0001호</p>
        <p>해외 : 82-1712-7447</p>
        <p>
          이 사이트는 인터넷 그린쇼핑에서 구축하고 재단법인
          한국쇼핑사업진흥원에서 운영합니다.
        </p>
        <p>Copyright © 2025. Egreen all rights reserved.</p>
        <p>그린쇼핑은 고객님의 결제금액에 대해 안전거래를 보장합니다.</p>
        <p>
          단,“결제대금 예치 또는 소비자 피해보상보험계약 등의 체결이 면제되는
          거래에 관한 고시”에
        </p>
        <p>
          따른 공공기관이 운영하는 쇼핑몰로 결제대금예치 또는
          소비자피해보상보험계약 등의 체결은 면제되었습니다.
        </p>
        <!-- footer구역을 오른쪽 왼쪽으로 나뉘게 구분선 필요 -->
        <!-- footer왼쪽 -->
        <p>그린고객센터</p>
        <p>1588-7447(발신자부담) help@greenshopping.or.kr</p>
        <p>평일 09:00 ~18:00 (토요일,공휴일 휴무)</p>
        <!-- 그 외 인증마크 이미지 추가필요 -->

        Copyright © 2014. ePOST all rights reserved.
      </footer>
    </main>
  </body>
</html>
<!-- 사이드바 영역 추가 필요 -->
